base/Catalogs/бит_ПользовательскиеВыборыВарианта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПользовательскиеВыборыВарианта</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодВычисленияВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеТипаЗначенийВариантов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВычисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_ПользовательскиеУсловия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПользовательскиеУсловия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодУсловия</Name>
					<Comment>Код условия на внутреннем языке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольноеУсловие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстВыполнения</Name>
					<Comment>Контекст выполнения пользовательского условия</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_КонтекстыВыполненияПользовательскихУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Comment>Алгоритм</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПользовательскогоУсловия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыПользовательскихУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкобкаНачало</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Comment>Вид сравнения</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыСравненияТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкобкаКонец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъединениеСПоследующим</Name>
							<Comment>Объединение с последующим</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ТипыОбъединенияУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Comment>Это выражение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыУсловий</Name>
					<Comment>Параметры условий</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИД_Условия</Name>
							<Comment>Идентификатор условия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Comment>Вид сравнения</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыСравненияТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
					<Comment>Дополнительные параметры</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя параметра</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолеваяАдресация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольИсполнителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСписковУсловий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторУсловия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ПользовательскиеВыборыВарианта/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроверитьВычислениеВарианта();
	
	ТекущееОграничение = Неопределено;
	Если ОграничитьТипЗначенийВариантов Тогда
		ТекущееОграничение = ОграничениеТипаВариантов;
	КонецЕсли;
	
	ТекущийОбъект.ОграничениеТипаЗначенийВариантов = Новый ХранилищеЗначения(ТекущееОграничение, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если РежимПроверкиВычисления Тогда
		НепроверяемыеРеквизиты.Добавить("Объект");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура СписокОбъектовПриИзмененииНаСервере()
	
	СохранитьСписокОбъектов();
	ОбновитьДеревоКонтекста();
	УстановитьОграничениеПроверяемогоОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовПриИзменении(Элемент)
	
	СписокОбъектовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДоступныеВидыОбъектов = Новый СписокЗначений;
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Справочник"));
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Задача"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокОбъектов",                СписокОбъектов);
	ПараметрыФормы.Вставить("ДоступныеВидыОбъектов",         ДоступныеВидыОбъектов);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",            Истина);
	ОткрытьФорму("Справочник.бит_ПользовательскиеУсловия.Форма.ВыборОбъектовСистемы", ПараметрыФормы, Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверочныйОбъектПриИзменении(Элемент)
	
	РезультатРасчета = Неопределено;
	ТипРезультата    = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьТипЗначенийВариантовПриИзменении(Элемент)
	
	Элементы.ОграничениеТипаВариантов.Доступность = ОграничитьТипЗначенийВариантов;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоКонтекста

&НаКлиенте
Процедура ДеревоКонтекстаПередРазворачиванием(Элемент, Строка, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьФункциональностьСтроки(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКонтекстаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПутьКДанным = ПутьКДаннымПоСтрокеДерева(ВыбраннаяСтрока);
	Если ПустаяСтрока(ПутьКДанным) Тогда
		Возврат;
	КонецЕсли;
	
	КодВычисленияВарианта = Объект.КодВычисленияВарианта;
	Если ПустаяСтрока(КодВычисленияВарианта) Тогда
		КодВычисленияВарианта = "Результат = " + ПутьКДанным + ";";
	Иначе
		КодВычисленияВарианта = КодВычисленияВарианта + " " + ПутьКДанным;
	КонецЕсли;
	Объект.КодВычисленияВарианта = КодВычисленияВарианта;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКонтекстаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ПутьКДанным = ПутьКДаннымПоСтрокеДерева(Элементы.ДеревоКонтекста.ТекущаяСтрока);
	ПараметрыПеретаскивания.Значение = ПутьКДанным;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыРасчета

&НаКлиенте
Процедура ПараметрыВычисленияНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ШаболонПараметра = "ПараметрыВычисления[""%1""]";
	ПараметрыПеретаскивания.Значение = СтрШаблон(ШаболонПараметра,
										Элементы.ПараметрыВычисления.ТекущиеДанные.ИмяПараметра);
	
КонецПроцедуры
									
&НаКлиенте
Процедура ПараметрыРасчетаИмяПараметраОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПараметрыВычисления.ТекущиеДанные;
	
	ПреобразованноеИмя = бит_ОбщегоНазначенияКлиентСервер.ПреобразоватьСтрокуВДопустимоеНаименованиеКолонки(Текст);
	Если НЕ ПустаяСтрока(ПреобразованноеИмя) Тогда
		Попытка
			Результат = Новый Структура(ПреобразованноеИмя); 
		Исключение
			ТекстСообщения = НСтр("ru='Имя параметра не может содержать пробелы или спец-символы';
								|en='The parameter name cannot contain spaces or special characters'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.ПараметрыВычисления",
																ТекущиеДанные.НомерСтроки,
																"ИмяПараметра");			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Поле,"Объект");
		КонецПопытки; 
	КонецЕсли; 
	
	ТекущиеДанные.ИмяПараметра = ПреобразованноеИмя;
	Если ПреобразованноеИмя <> Текст Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Имя параметра изменено. Было ""%1"", стало ""%2"".';
										|en='Parameter name changed. Was ""%1"" was ""%2"".'") , Текст, ПреобразованноеИмя);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПроверитьВыборВарианта(Команда)
	
	ПроверитьВыборВариантаНаСервере();
	Если РезультатРасчета = Неопределено Тогда
		ТекущийЭлемент = Элементы.КодВычисленияВарианта;
	Иначе
		ТекущийЭлемент = Элементы.РезультатРасчета;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВыборВариантаНаСервере()
	
	РежимПроверкиВычисления    = Истина;
	ПроверкаЗаполненияПройдена = ПроверитьЗаполнение();
	РежимПроверкиВычисления    = Ложь;
	Если НЕ ПроверкаЗаполненияПройдена Тогда
		Возврат;
	КонецЕсли; 
	
	ПроверитьВычислениеВарианта();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗагрузитьСписокОбъектов();
	ОбновитьДеревоКонтекста();
	УстановитьОграничениеПроверяемогоОбъекта();
	УстановитьОграничениеЗначенийВариантов();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокОбъектов()
	
	МассивОбъектов = Объект.ОбъектыСистемы.Выгрузить().ВыгрузитьКолонку("ОбъектСистемы");
	СписокОбъектов.ЗагрузитьЗначения(МассивОбъектов);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСписокОбъектов()
	
	ОбъектыСистемы = Объект.ОбъектыСистемы;
		
	ОбъектыСистемы.Очистить();
	Для каждого ЭлементСписка Из СписокОбъектов Цикл
		СтрокаОбъекта = ОбъектыСистемы.Добавить();
		СтрокаОбъекта.ОбъектСистемы = ЭлементСписка.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоКонтекста()
	
	Функциональность = РеквизитФормыВЗначение("ДеревоКонтекста");
	
	Функциональность.Строки.Очистить();
	
	ВывестиФункциональностьТекущихОбъектов(Функциональность);
	
	РазделУстановленныеВизы = НовыйФункционал(Функциональность,
											"УстановленныеВизы",
											НСтр("ru='Установленные визы';en='Established visas'"));
	НовыйФункционал(РазделУстановленныеВизы,
					"ВсеВизыПолучены",
					НСтр("ru='Все визы получены';en='All visas received'"));
	НовыйФункционал(РазделУстановленныеВизы,
					"ПринятоРешение",
					НСтр("ru='Принято решение';en='The decision was made'"));
	НовыйФункционал(РазделУстановленныеВизы,
					"ПринятоРешениеПоВизе",
					НСтр("ru='Принято решение по визе';en='Visa decision made'"));
	НовыйФункционал(РазделУстановленныеВизы,
					"ПринятоРешениеПоВышестоящимВизам",
					НСтр("ru='Принято решение по вышестоящим визам';
						|en='Decision made on superior visas'"));
	НовыйФункционал(РазделУстановленныеВизы,
					"ПринятыРешенияПоВышестоящимВизам",
					НСтр("ru='Приняты решения по вышестоящим визам';
						|en='Decisions made on superior visas'"));
	
	РазделДополнительно = НовыйФункционал(Функциональность,
											"Дополнительно",
											НСтр("ru='Дополнительно';en='Other'"));
	НовыйФункционал(РазделДополнительно,
					"Статус",
					НСтр("ru='Статус';en='Status'"),
					Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов"));
	НовыйФункционал(РазделДополнительно,
					"ТекущийПользователь",
					НСтр("ru='Текущий пользователь';en='Current User'"),
					Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	ЗначениеВРеквизитФормы(Функциональность, "ДеревоКонтекста");

	
КонецПроцедуры

&НаСервере
Процедура ВывестиФункциональностьТекущихОбъектов(Функциональность)
	
	Если СписокОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивИменТипов = Новый Массив;
	Запрос          = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыСистемы.ИмяОбъекта КАК ИмяОбъекта,
	|	ОбъектыСистемы.ВидОбъекта КАК ВидОбъекта
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|ГДЕ
	|	ОбъектыСистемы.Ссылка В(&СписокОбъектов)";
	Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектов);
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОбъектов.Следующий() Цикл
		ИмяТипа       = бит_УправлениеОбъектамиСистемы.ПолучитьИмяТипаОбъекта(ВыборкаОбъектов.ИмяОбъекта,
																				ВыборкаОбъектов.ВидОбъекта);
		МассивИменТипов.Добавить(ИмяТипа);
	КонецЦикла;
	ИменаТиповСтрокой = СтрСоединить(МассивИменТипов, ", ");
	Описание = Новый ОписаниеТипов(ИменаТиповСтрокой);
	
	НовыйФункционал(Функциональность,
					"ТекущийОбъект",
					НСтр("ru='Текущий объект';en='Current object'"),
					Описание);
	
КонецПроцедуры

&НаСервере
Функция НовыйФункционал(ВладелецФукнционала, Имя, Синоним, ОписаниеТипов = Неопределено)
	
	Если СтрНачинаетсяС(Имя, "Удалить") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтоЭлементДерева = (ТипЗнч(ВладелецФукнционала) = Тип("ДанныеФормыЭлементДерева"));
	Если ЭтоЭлементДерева Тогда
		Коллекция = ВладелецФукнционала.ПолучитьЭлементы();
	Иначе	
		Коллекция = ВладелецФукнционала.Строки;
	КонецЕсли;
	
	НовыйФункционал = Коллекция.Добавить();
	НовыйФункционал.Имя     = Имя;
	НовыйФункционал.Синоним = Синоним;
	
	ТекОписаниеТипов        = ?(ОписаниеТипов = Неопределено,Новый ОписаниеТипов("Строка"),ОписаниеТипов);
	НовыйФункционал.Типы    = ТекОписаниеТипов;
	
	ОпределитьКартинкуСтроки(НовыйФункционал);
	
	Для каждого Тип Из ТекОписаниеТипов.Типы() Цикл
		Если ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
			Если ОбщегоНазначения.ЭтоПеречисление(Метаданные.НайтиПоТипу(Тип)) Тогда
				Продолжить;
			КонецЕсли; 
			НовыйФункционал.ОбработатьПодчиненные = Истина;
			Если ЭтоЭлементДерева Тогда
				НовыйФункционал.ПолучитьЭлементы().Добавить();
			Иначе
				НовыйФункционал.Строки.Добавить();
			КонецЕсли;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат НовыйФункционал;
	
КонецФункции

&НаСервере
Процедура ОпределитьКартинкуСтроки(ТекущаяСтрока)
	
	КартинкаСтроки = Неопределено;
	
	Если ТекущаяСтрока.Имя = "ТекущийОбъект"
		ИЛИ ТекущаяСтрока.Имя = "УстановленныеВизы"
		ИЛИ ТекущаяСтрока.Имя = "Дополнительно" Тогда
		КартинкаСтроки = БиблиотекаКартинок.бит_Реквизиты;
	ИначеЕсли ТекущаяСтрока.Имя = "ВсеВизыПолучены"
		ИЛИ ТекущаяСтрока.Имя = "ПринятоРешение"
		ИЛИ ТекущаяСтрока.Имя = "ПринятоРешениеПоВизе"
		ИЛИ ТекущаяСтрока.Имя = "ПринятоРешениеПоВышестоящимВизам"
		ИЛИ ТекущаяСтрока.Имя = "ПринятыРешенияПоВышестоящимВизам" Тогда
		КартинкаСтроки = БиблиотекаКартинок.бит_казна_ПользовательскиеФункции;
	Иначе
		КартинкаСтроки = БиблиотекаКартинок.бит_Реквизит;
	КонецЕсли;
	
	ТекущаяСтрока.Картинка = КартинкаСтроки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФункциональностьСтроки(Знач ИдентификаторСтроки)
	
	ЭлементДерева = ДеревоКонтекста.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если НЕ ЭлементДерева.ОбработатьПодчиненные Тогда
		Возврат;
	КонецЕсли;
	
	ПодчиненныеСтроки = ЭлементДерева.ПолучитьЭлементы();
	ПодчиненныеСтроки.Очистить();
	
	ЗаполнитьОписаниеРеквизитов(ЭлементДерева);
	ЗаполнитьОписаниеДопРеквизитов(ЭлементДерева);
	
	ЭлементДерева.ОбработатьПодчиненные = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеРеквизитов(СтрокаДерева)
	
	ОбщиеРеквизиты = Новый ТаблицаЗначений(); 
	ОбщиеРеквизиты.Колонки.Добавить("Имя");
	ОбщиеРеквизиты.Колонки.Добавить("Синоним");
	ОбщиеРеквизиты.Колонки.Добавить("Типы");
	
	СписокОбщихРеквизитов = Новый СписокЗначений;
	ЭтоПервыйЭлемент      = Истина;
	
	Для каждого Тип Из СтрокаДерева.Типы.Типы() Цикл
		
		СписокТекущихРеквизитов = Новый СписокЗначений;
		
		Если ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
			
			МетаданныеСтроки = Метаданные.НайтиПоТипу(Тип);
			Для каждого Реквизит Из МетаданныеСтроки.СтандартныеРеквизиты Цикл
				Если Реквизит.Имя = "Ссылка" Тогда
					Продолжить;				
				КонецЕсли;
				ДобавитьОписаниеРеквизита(Реквизит, ОбщиеРеквизиты, СписокТекущихРеквизитов);
			КонецЦикла;
			
			Если ОбщегоНазначения.ЭтоПеречисление(МетаданныеСтроки) Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого Реквизит Из МетаданныеСтроки.Реквизиты Цикл
				ДобавитьОписаниеРеквизита(Реквизит, ОбщиеРеквизиты, СписокТекущихРеквизитов);
			КонецЦикла;
			
			Если ОбщегоНазначения.ЭтоЗадача(МетаданныеСтроки) Тогда
				Реквизит = МетаданныеСтроки.РеквизитыАдресации.Найти("Исполнитель");
				Если Реквизит <> Неопределено Тогда
					ДобавитьОписаниеРеквизита(Реквизит, ОбщиеРеквизиты, СписокТекущихРеквизитов);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоПервыйЭлемент Тогда
			СписокОбщихРеквизитов = СписокТекущихРеквизитов;
		Иначе
			Для Индекс = 1 - СписокОбщихРеквизитов.Количество() По 0 Цикл
			    ЭлементОбъединенногоСписка  = СписокОбщихРеквизитов.Получить(-Индекс);
				РеквизитОбъединенногоСписка = ЭлементОбъединенногоСписка.Значение;
			    Если СписокТекущихРеквизитов.НайтиПоЗначению(РеквизитОбъединенногоСписка) = Неопределено Тогда
			        СписокОбщихРеквизитов.Удалить(ЭлементОбъединенногоСписка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ЭтоПервыйЭлемент = Ложь;
	КонецЦикла;
	
	Имена = ОбщиеРеквизиты.Скопировать(,"Имя, Синоним");
	Имена.Свернуть("Имя, Синоним");
	Имена.Сортировать("Синоним, Имя");
	Для каждого СтрокаТаблицы Из Имена Цикл
		
		Если СтрокаДерева.Имя = "ТекущийОбъект"
			И СписокОбщихРеквизитов.НайтиПоЗначению(СтрокаТаблицы.Имя) = Неопределено Тогда
			// Для составных типов доступны только реквизиты, присустствующие во всех объектах.
			Продолжить;
		КонецЕсли;
		
		ОбщийТип = Новый Массив();
		НайденныеСтроки = ОбщиеРеквизиты.НайтиСтроки(Новый Структура("Имя, Синоним", СтрокаТаблицы.Имя, СтрокаТаблицы.Синоним));
		Если НайденныеСтроки.Количество() > 1 Тогда
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Для каждого Тип Из НайденнаяСтрока.Типы.Типы() Цикл
					ОбщийТип.Добавить(Тип);
				КонецЦикла; 
			КонецЦикла; 
			ОписаниеТипов = Новый ОписаниеТипов(ОбщийТип);
		Иначе
			ОписаниеТипов = НайденныеСтроки[0].Типы;
		КонецЕсли;
		
		НовыйФункционал(СтрокаДерева, СтрокаТаблицы.Имя, СтрокаТаблицы.Синоним, ОписаниеТипов);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОписаниеРеквизита(Реквизит, ОбщиеРеквизиты, СписокТекущихРеквизитов)
	
	ИмяРеквизита = Реквизит.Имя;
	НоваяСтрока  = ОбщиеРеквизиты.Добавить();
	НоваяСтрока.Имя     = ИмяРеквизита;
	НоваяСтрока.Синоним = Реквизит.Представление();
	НоваяСтрока.Типы    = Реквизит.Тип;
	
	СписокТекущихРеквизитов.Добавить(ИмяРеквизита);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеДопРеквизитов(СтрокаДерева)
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		Возврат;
	КонецЕсли; 	
	
	Коллекция = СтрокаДерева.ПолучитьЭлементы();
	
	Для каждого Тип Из СтрокаДерева.Типы.Типы() Цикл
		
		МетаОбъект = Метаданные.НайтиПоТипу(Тип);
		Если МетаОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ОбщегоНазначения.ЭтоПеречисление(МетаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектМетаданых = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаОбъект);
		Если ЗначениеЗаполнено(ОбъектМетаданых) Тогда
			ИмяНабора = СтрЗаменить(ОбъектМетаданых.ПолноеИмя, ".", "_");
		Иначе
			ИмяНабора = "";
		КонецЕсли; 
		
		НаборСсылка = УправлениеСвойствами.НаборСвойствПоИмени(ИмяНабора);
		Если НаборСсылка = Неопределено Тогда
			Попытка
				НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений[ИмяНабора];
			Исключение
				НаборСсылка = Неопределено;
			КонецПопытки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НаборСсылка) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("НаборСсылка", НаборСсылка);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТабДопРеквизиты.Свойство КАК Свойство,
			|	ТабДопРеквизиты.Свойство.Наименование КАК Наименование,
			|	ТабДопРеквизиты.Свойство.ТипЗначения КАК ТипЗначения,
			|	""ДополнительныйРеквизит"" КАК ВидПоля,
			|	ТабДопРеквизиты.Свойство.Имя КАК СвойствоИмя
			|ИЗ
			|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ТабДопРеквизиты
			|ГДЕ
			|	ТабДопРеквизиты.Ссылка = &НаборСсылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТабДопСведения.Свойство,
			|	ТабДопСведения.Свойство.Наименование,
			|	ТабДопСведения.Свойство.ТипЗначения,
			|	""ДополнительноеСведение"",
			|	ТабДопСведения.Свойство.Имя
			|ИЗ
			|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК ТабДопСведения
			|ГДЕ
			|	ТабДопСведения.Ссылка = &НаборСсылка";
			
			ШаблонПредставленияРеквизита = НСтр("ru='%1 (Доп. реквизит)';en='%1 (Add. property)'");
			ШаблонПредставленияСведения  = НСтр("ru='%1 (Доп. сведение)';en='%1 (Add. info)'");
			
			Результат = Запрос.Выполнить();
			Выборка   = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Имя = Выборка.ВидПоля + "_" + Выборка.СвойствоИмя; 
				Если Выборка.ВидПоля = "ДополнительныйРеквизит" Тогда
					Синоним = СтрШаблон(ШаблонПредставленияРеквизита, Выборка.Наименование);
				Иначе
					Синоним = СтрШаблон(ШаблонПредставленияСведения, Выборка.Наименование);
				КонецЕсли;
				НовыйФункционал(СтрокаДерева, Имя, Синоним, Выборка.ТипЗначения);
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Функция ПутьКДаннымПоСтрокеДерева(ИдентификаторСтроки)
	
	ТекущаяСтрока = ДеревоКонтекста.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ПутьКДанным = ТекущаяСтрока.Имя;
	ДополнитьПутьКДаннымПоДереву(ТекущаяСтрока, ПутьКДанным);
	
	ОбработатьДопСвойствоРеквизит(ПутьКДанным, "ДополнительныйРеквизит");
	ОбработатьДопСвойствоРеквизит(ПутьКДанным, "ДополнительноеСведение");
	ОбработатьУстановленныеВизы(ПутьКДанным);
	
	Возврат ПутьКДанным;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПутьКДаннымПоДереву(ТекущаяСтрока, ПутьКДанным)
	
	СтрокаРодитель = ТекущаяСтрока.ПолучитьРодителя();
	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКДанным = СтрокаРодитель.Имя + "." + ПутьКДанным;
	ДополнитьПутьКДаннымПоДереву(СтрокаРодитель, ПутьКДанным)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДопСвойствоРеквизит(ПутьКДанным, ВидДанных)
	
	ПозицияДопЗначения = СтрНайти(ПутьКДанным, "." + ВидДанных + "_");
	Если ПозицияДопЗначения = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВладелецДопЗначения = Лев(ПутьКДанным, ПозицияДопЗначения - 1);
	ПраваяЧасть = Сред(ПутьКДанным, ПозицияДопЗначения + СтрДлина(ВидДанных) + 2);
	
	ПозицияРеквизтаДопЗначения = СтрНайти(ПраваяЧасть, ".");
	Если ПозицияРеквизтаДопЗначения = 0 Тогда
		ИмяДопЗначения      = ПраваяЧасть;
		РеквизитДопЗначения = "";
	Иначе
		ИмяДопЗначения = Лев(ПраваяЧасть, ПозицияРеквизтаДопЗначения - 1);
		РеквизитДопЗначения = Сред(ПраваяЧасть, ПозицияРеквизтаДопЗначения);
	КонецЕсли;
	
	ШаблонПути = "ДополнительноеСвойство(%1, ""%2"")%3";
	
	ПутьКДанным = СтрШаблон(ШаблонПути, ВладелецДопЗначения, ИмяДопЗначения, РеквизитДопЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьУстановленныеВизы(ПутьКДанным)
	
	Если НЕ СтрНачинаетсяС(ПутьКДанным, "УстановленныеВизы.") Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "УстановленныеВизы.", "");
	Если ПутьКДанным = "ВсеВизыПолучены" Тогда
		ПутьКДанным = "ВсеВизыПолучены(ТекущийОбъект.Ссылка)";
	ИначеЕсли ПутьКДанным = "ПринятоРешение" Тогда
		ШаблонФункции   = "ПринятоРешение(ТекущийОбъект.Ссылка, %1)";
		ПараметрРешение = ПараметрУстановленныеВизыРешение();
		ПутьКДанным     = СтрШаблон(ШаблонФункции, ПараметрРешение);
	ИначеЕсли ПутьКДанным = "ПринятоРешениеПоВизе" Тогда
		ШаблонФункции = "ПринятоРешениеПоВизе(ТекущийОбъект.Ссылка, %1)";
		ПараметрВиза  = ПараметрУстановленныеВизыВиза();
		ПутьКДанным   = СтрШаблон(ШаблонФункции, ПараметрВиза);
	ИначеЕсли ПутьКДанным = "ПринятоРешениеПоВышестоящимВизам" Тогда
		ШаблонФункции   = "ПринятоРешениеПоВышестоящимВизам(ТекущийОбъект.Ссылка, %1, %2)";
		ПараметрВиза    = ПараметрУстановленныеВизыВиза();
		ПараметрРешение = ПараметрУстановленныеВизыРешение();
		ПутьКДанным     = СтрШаблон(ШаблонФункции, ПараметрВиза, ПараметрРешение);
	ИначеЕсли ПутьКДанным = "ПринятыРешенияПоВышестоящимВизам" Тогда
		ШаблонФункции   = "ПринятыРешенияПоВышестоящимВизам(ТекущийОбъект.Ссылка, %1)";
		ПараметрВиза    = ПараметрУстановленныеВизыВиза();
		ПутьКДанным     = СтрШаблон(ШаблонФункции, ПараметрВиза);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрУстановленныеВизыРешение()
	
	ИмяПараметра = "";
	
	ТипРешение = Тип("СправочникСсылка.бит_ВидыРешенийСогласования");
	Для каждого СтрокаПараметра Из Объект.ПараметрыВычисления Цикл
		Если ТипЗнч(СтрокаПараметра.ЗначениеПараметра) = ТипРешение Тогда
			ИмяПараметра = СтрокаПараметра.ИмяПараметра;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ИмяПараметра) Тогда
		ИмяПараметра    = "Решение";
		ПараметрРешение = Объект.ПараметрыВычисления.Добавить();
		ПараметрРешение.ИмяПараметра      = ИмяПараметра;
		ПараметрРешение.ЗначениеПараметра = ПредопределенноеЗначение("Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка");
	КонецЕсли;
	
	ШаблонПараметра = "ПараметрыВычисления[""%1""]";
	ИмяПараметра    = СтрШаблон(ШаблонПараметра, ИмяПараметра);
	
	Если Элементы.ГруппаПараметрыВычисления.Скрыта() Тогда
		Элементы.ГруппаПараметрыВычисления.Показать();
	КонецЕсли;
	
	Возврат ИмяПараметра;
	
КонецФункции

&НаКлиенте
Функция ПараметрУстановленныеВизыВиза()
	
	ИмяПараметра = "";
	
	ТипВиза = Тип("СправочникСсылка.бит_Визы");
	Для каждого СтрокаПараметра Из Объект.ПараметрыВычисления Цикл
		Если ТипЗнч(СтрокаПараметра.ЗначениеПараметра) = ТипВиза Тогда
			ИмяПараметра = СтрокаПараметра.ИмяПараметра;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ИмяПараметра) Тогда
		ИмяПараметра    = "Виза";
		ПараметрРешение = Объект.ПараметрыВычисления.Добавить();
		ПараметрРешение.ИмяПараметра      = ИмяПараметра;
		ПараметрРешение.ЗначениеПараметра = ПредопределенноеЗначение("Справочник.бит_Визы.ПустаяСсылка");
	КонецЕсли;
	
	ШаблонПараметра = "ПараметрыВычисления[""%1""]";
	ИмяПараметра    = СтрШаблон(ШаблонПараметра, ИмяПараметра);
	
	Если Элементы.ГруппаПараметрыВычисления.Скрыта() Тогда
		Элементы.ГруппаПараметрыВычисления.Показать();
	КонецЕсли;
	
	Возврат ИмяПараметра;
	
КонецФункции

&НаСервере
Процедура ПроверитьВычислениеВарианта()
	
	Если ПустаяСтрока(Объект.КодВычисленияВарианта) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыСистемы = Объект.ОбъектыСистемы;
	
	Если НЕ ЗначениеЗаполнено(ПроверочныйОбъект) Тогда
		ОбъектСистемы    = ОбъектыСистемы[0].ОбъектСистемы;
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектыСистемы[0].ОбъектСистемы,
																		"ИмяОбъектаПолное, ВидОбъекта");
		ИмяОбъектаПолное = РеквизитыОбъекта.ИмяОбъектаПолное;
		ВидОбъекта       = РеквизитыОбъекта.ВидОбъекта;
		
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ТаблицаИсточник.Ссылка КАК Ссылка,
		|	ТаблицаИсточник.Дата КАК Дата,
		|	0 КАК ЗначениеВыбрано
		|ИЗ
		|	#ТаблицаИсточник КАК ТаблицаИсточник
		|ГДЕ
		|	НЕ ТаблицаИсточник.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ПустаяСсылка,
		|	ДАТАВРЕМЯ(1,1,1),
		|	1
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначениеВыбрано,
		|	Дата УБЫВ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТаблицаИсточник", ИмяОбъектаПолное);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПустаяСсылка", "ЗНАЧЕНИЕ(" + ИмяОбъектаПолное + ".ПустаяСсылка)");
		Если ВидОбъекта <> Перечисления.бит_ВидыОбъектовСистемы.Документ Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаИсточник.Дата", "NULL");
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		ВыборкаОбъектов = Запрос.Выполнить().Выбрать();
		ВыборкаОбъектов.Следующий();
		
		ПроверочныйОбъект = ВыборкаОбъектов.Ссылка;
	КонецЕсли;
	
	СтруктураКонтекст = бит_ВизированиеСервер.НовыеПараметрыПроверкиУсловия();
	СтруктураКонтекст.ТекущийОбъект = ПроверочныйОбъект;
	Если бит_ВизированиеСервер.ВизируемыеОбъектыСистемы().НайтиПоЗначению(ОбъектСистемы) <> Неопределено Тогда
		Отбор = Новый Структура("Объект", ПроверочныйОбъект);
		СтруктураКонтекст.Визы = бит_ВизированиеСервер.ПрочитатьНаборВиз(Отбор);
	КонецЕсли;
	
	РезультатРасчета = Справочники.бит_ПользовательскиеВыборыВарианта.ЗначениеПользовательскогоВарианта(
				РеквизитФормыВЗначение("Объект"), СтруктураКонтекст);
	Если РезультатРасчета = Неопределено Тогда
		ТипРезультата = "";
	Иначе
		ТипРезультата = "%1 (%2)";
		ЗначениеТип   = ТипЗнч(РезультатРасчета);
		ТипРезультата = СтрШаблон(ТипРезультата, ЗначениеТип, ОбщегоНазначения.СтроковоеПредставлениеТипа(ЗначениеТип));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеПроверяемогоОбъекта()
	
	Если Объект.ОбъектыСистемы.Количество() = 0 Тогда
		Элементы.ПроверочныйОбъект.ОграничениеТипа = Новый ОписаниеТипов;
	Иначе
		ШаблонТипа  = "%1Ссылка.%2";
		МассивТипов = Новый Массив;
		ОбъектыСистемы = Объект.ОбъектыСистемы.Выгрузить(,"ОбъектСистемы").ВыгрузитьКолонку("ОбъектСистемы");
		ДанныеОбъектов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ОбъектыСистемы, "ВидОбъекта, ИмяОбъекта");
		Для каждого ЭлементДанных Из ДанныеОбъектов Цикл
			ОбъектСистемы = ЭлементДанных.Ключ;
			ДанныеОбъекта = ЭлементДанных.Значение;
			Попытка
				ТипОбъекта = Тип(СтрШаблон(ШаблонТипа, ДанныеОбъекта.ВидОбъекта, ДанныеОбъекта.ИмяОбъекта));
				МассивТипов.Добавить(ТипОбъекта);
			Исключение
				ТекстСообщения = НСтр("ru='Не удалось получить значение типа для %1';
										|en='Не удалось получить значение типа для %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектСистемы);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
		КонецЦикла;
		
		Элементы.ПроверочныйОбъект.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		
		Если ПроверочныйОбъект <> Неопределено Тогда
			ПроверочныйОбъект = Элементы.ПроверочныйОбъект.ОграничениеТипа.ПривестиЗначение(ПроверочныйОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеЗначенийВариантов()
	
	СправочникОбъект   = РеквизитФормыВЗначение("Объект");
	ТекущееОграничение = СправочникОбъект.ОграничениеТипаЗначенийВариантов.Получить();
	Если ТекущееОграничение = Неопределено Тогда
		ОграничитьТипЗначенийВариантов = Ложь;
	Иначе
		ОграничитьТипЗначенийВариантов = Истина;
		ОграничениеТипаВариантов       = ТекущееОграничение;
	КонецЕсли;
	
	Элементы.ОграничениеТипаВариантов.Доступность = ОграничитьТипЗначенийВариантов;
	
КонецПроцедуры

#КонецОбласти
